cask_args appdir: '~/Applications'

#tap 'homebrew/bundle'
#tap 'homebrew/homebrew-core'
#tap 'homebrew/dupes'
#tap 'homebrew/games'
#tap 'homebrew/versions'
#tap 'homebrew/science'
#tap 'homebrew/completions'
#tap 'homebrew/services'
# tap 'homebrew/cask-fonts'
# tap 'homebrew/cask-versions'



# ================================
# TODO: Sort
# ================================
# brew 'bitwise'

# ================================
# DEPS / PROGRAMMING LANGUAGES
# ================================
brew 'git'
brew 'golang'
brew 'python'                       # Interpreted, interactive, object-oriented programming language
brew 'python3'                      # Interpreted, interactive, object-oriented programming language
brew 'python-setuptools'
brew 'rustup'                       #

# ================================
# Virtual Machine stuff
# ================================
# brew 'packer'
# brew 'packer-completion'

# ================================
# CLI stuff
# ================================
#brew 'git-crypt'                    # Enable transparent encryption/decryption of files in a git repo
#brew 'sshfs'                       # File system client based on SSH File Transfer Protocol
#brew 'stow'                        # Organize software neatly under a single directory tree (e.g. /usr/local)
#brew 'goaccess'                     # Log analyzer and interactive viewer for the Apache Webserver
#brew 'pipx'                         #
# tap 'mergestat/mergestat'
# brew 'mergestat'

# brew 'ffmpeg'                       # Play, record, convert, and stream audio and video
# brew 'imageoptim-cli'               # CLI for ImageOptim, ImageAlpha and JPEGmini
#brew 'eth-p/software/bat-extras'   # Bash scripts that integrate bat with various command-line tools
#brew 'fx'                           # Terminal JSON viewer
#brew 'svgo'                         # Nodejs-based tool for optimizing SVG vector graphics files
brew 'ipinfo-cli'
brew 'jordanbaird-ice'
# brew 'aha'
# brew 'aria2'                        # Download with resuming and segmented downloading
# brew 'asdf'
# brew 'ast-grep'
# brew 'atuin'
brew 'autoconf'                     # Automatic configure script builder
brew 'autojump'                     # Shell extension to jump to frequently used directories
brew 'automake'                     # Tool for generating GNU Standards-compliant Makefiles
# brew 'axel'                         # Light UNIX download accelerator
brew 'bandwhich'                    # Bourne-Again SHell, a UNIX command interpreter
brew 'bash-completion2'             # Programmable completion for Bash 4.1+
brew 'bash'                         # Bourne-Again SHell, a UNIX command interpreter
# brew 'bento4'                       # Full-featured MP4 format and MPEG DASH library and tools
brew 'bkt'
brew 'bmon'                         # Interface bandwidth monitor
brew 'borgbackup'                   # Deduplicating archiver with compression and authenticated encryption
# brew 'bottom'                       #
# brew 'broot'                        # New way to see and navigate directory trees
brew 'choose-rust'
brew 'cliclick'                     # Tool for emulating mouse and keyboard events
brew 'clipboard'                    #
brew 'cloc'                         # Statistics utility to count lines of code
brew 'colordiff'                    # Color-highlighted diff(1) output
brew 'croc'
brew 'ctop'
brew 'curl'                         #
# brew 'curlie'                       #
brew 'cv'                           # Progress: Coreutils Progress Viewer                      #
brew 'ddh'
brew 'debianutils'
brew 'delta'
brew 'dssim'                        #
brew 'dfc'                          # Display graphs and colors of file system space/usage
brew 'dialog'                       # Display user-friendly message boxes from shell scripts
brew 'direnv'                       # Load/unload environment variables based on $PWD
brew 'docker-compose'               # Isolated development environments using Docker
brew 'docker-machine'               # Create Docker hosts locally and on cloud providers
brew 'dolt'                         # Git for Data
brew 'dprint'
brew 'duf'
brew 'dust'                         # More intuitive version of du in rust
brew 'duti'
brew 'duti'                         # A command-line tool to select default applications for document types and URL schemes on Mac OS X
brew 'entr'                         # Run arbitrary commands when files change
brew 'erdtree'
brew 'exercism'                     # Command-line tool to interact with exercism.io
brew 'exiftool'                     # Perl lib for reading and writing EXIF metadata
brew 'eza'
brew 'faas-cli'                     # CLI for templating and/or deploying FaaS functions
brew 'fastmod'                      #
brew 'fd'                           # Simple, fast and user-friendly alternative to find
brew 'fdupes'
brew 'fish'                         # User-friendly command-line shell for UNIX-like operating systems
# brew 'fnm'                          # Fast and simple Node.js version manager
brew 'fping'                        # Scriptable ping program for checking if multiple hosts are up
brew 'fselect'                      # Find files with SQL-like queries
brew 'fswatch'                      # Monitor a directory for changes and run a shell command
brew 'geoip'                        #
brew 'git-sizer'                    #
brew 'gitui'
brew 'glow'                         #
brew 'gojq'
brew 'gotop'                        # Terminal based graphical activity monitor inspired by gtop and vtop
brew 'gpg'                          # GNU Pretty Good Privacy (PGP) package
brew 'graphviz'                     # Graph visualization software from AT&T and Bell Labs
brew 'grc'                          # Colorize logfiles and command output
brew 'grex'                         # Command-line tool for generating regular expressions
brew 'gron'                         #
brew 'handbrake'                    # Open-source video transcoder available for Linux, Mac, and Windows
brew 'hashdeep'                     # Recursively compute digests on files/directories
brew 'hh'                           # Bash and zsh history suggest box
brew 'htmlq'
brew 'htop'                         # Improved top (interactive process viewer)
brew 'httpie'                       # User-friendly cURL replacement (command-line HTTP client)
brew 'httpry'                       # Packet sniffer for displaying and logging HTTP traffic
brew 'hyperfine'                    # Command-line benchmarking tool
brew 'ifstat'                       # Tool to report network interface bandwidth
brew 'iftop'                        # Display an interface's bandwidth usage
# brew 'imagemagick'                  # Tools and libraries to manipulate images in many formats
# brew 'inlyne'
brew 'plow'
brew 'jc'
brew 'jid'                          # Json incremental digger
brew 'jless'                        #
brew 'jpeg'                         # Image manipulation library
brew 'jpegoptim'                    # Utility to optimize JPEG files
# brew 'jplot'
brew 'just'
# brew 'katana'
brew 'kondo'                        # Save disk space by cleaning non-essential files from software projects
brew 'kubernetes-cli'               # Tool to report network interface bandwidth
brew 'lazydocker'                   # The lazier way to manage everything docker
brew 'lazygit'                      #
brew 'lf'                           #
brew 'libeatmydata'
brew 'lnav'                         # Curses-based tool for viewing and analyzing log files
brew 'lxc'                          #
brew 'm-cli'                        # Swiss Army Knife for macOS
brew 'mackup'                       # Keep your Mac's application settings in sync
brew 'macpine'
brew 'mas'                          # Mac App Store command-line interface
# brew 'masscan'                      # TCP port scanner, scans entire Internet in under 5 minutes
brew 'mdbook'
brew 'micro'                        # Modern and intuitive terminal-based text editor
brew 'miller'                       #
brew 'mist'                         # Mac command-line tool that automatically downloads macOS Installers / Firmwares
brew 'mmv'                          # Move, copy, append, and link multiple files
brew 'mosh'                         #
brew 'most'                         # Powerful paging program
brew 'mozjpeg'                      # Improved JPEG encoder
brew 'mtr'                          # 'traceroute' and 'ping' in a single tool
brew 'multitail'                    # Tail multiple files in one terminal simultaneously
brew 'navi'
brew 'ncdu'                         # NCurses Disk Usage
brew 'neofetch'                     # Fast, highly customisable system info script
brew 'nethogs'                      # Net top tool grouping bandwidth per process
brew 'nginx'                        # HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew 'ngrep'                        # Network grep
brew 'nload'                        # Realtime console network usage monitor
brew 'nmap'                         # Port scanning utility for large networks
brew 'noti'                         # Trigger notifications when a process completes
# brew 'nushell'                      # Modern shell for the GitHub era
brew 'optipng'                      # PNG file optimizer
brew 'ouch'
brew 'pbzip2'                       # Parallel bzip2
brew 'pgrep'                        # OpenBSD and Darwin versions of pgrep, pkill, and pfind
brew 'pidof'                        # Display the PID number for a given process name
brew 'pigz'                         # Parallel gzip
brew 'pixz'                         # Parallel, indexed, xz compressor
brew 'plzip'                        # Data compressor
brew 'pngcheck'                     # Print info and check PNG, JNG, and MNG files
brew 'pngquant'                     # PNG image optimizing utility
brew 'ppsspp'                       # PlayStation Portable emulator
brew 'procs'                        # Modern replacement for ps written by Rust
brew 'psgrep'                       # Shortcut for the 'ps aux | grep' idiom
brew 'pup'                          #
brew 'pv'                           # Monitor data's progress through a pipe
brew 'pygments'                     # Generic syntax highlighter
brew 'qemu'
brew 'rargs'                        # Util like xargs + awk with pattern matching support
brew 'rclone'                       #
brew 'rdiff-backup'                 # Reverse differential backup tool, over a network or locally
brew 'rename'                       # Perl-powered file rename script with many helpful built-ins
brew 'renameutils'                  # Tools for file renaming
brew 'ripgrep-all'                  # Wrapper around ripgrep that adds multiple rich file types
brew 'ripgrep'                      # Search tool like grep and The Silver Searcher
brew 'rnr'
brew 'rsnapshot'                    # File system snapshot utility (based on rsync)
brew 'rsync'                        # Utility that provides fast incremental file transfer
brew 'rust-parallel'
brew 'sd'                           # Intuitive find & replace CLI
brew 'serf'
brew 'shallow-backup'
brew 'sk'                           # Fuzzy Finder in rust!
brew 'sponge'
brew 'static-web-server'
brew 'sqlite'                       # Command-line interface for SQLite
brew 'sshuttle'                     # Proxy server that works as a poor man's VPN
# brew 'starship'                     # Cross-shell prompt for astronauts
brew 'streamlink'
brew 'stress'                       # Tool to impose load on and stress test a computer system
brew 'svn'                          #
brew 'svtplay-dl'                   # Download videos from https://www.svtplay.se/
brew 'sysbench'                     # System performance benchmark tool
brew 'tealdeer'                     # Very fast implementation of tldr in Rust
brew 'thefuck'                      # Programmatically correct mistyped console commands
brew 'tig'                          # Text interface for Git repositories
brew 'tmux'                         # Terminal multiplexer
brew 'tokei'                        # Program that allows you to count code, quickly
brew 'trash'                        # CLI tool that moves files or folder to the trash
brew 'tree'                         # Display directories as trees (with optional color/HTML output)
brew 'unar'                         # Command-line unarchiving tools supporting multiple formats
brew 'unison'                       # File synchronization tool for OSX
brew 'upx'
brew 'vbindiff'                     # Visual Binary Diff
brew 'vcsh'                         # Config manager based on git
brew 'vegeta'
brew 'viddy'
brew 'vips'                         # Image processing library
brew 'vnstat'                       # Console-based network traffic monitor
brew 'watch'                        # Executes a program periodically, showing output fullscreen
brew 'watchman'                     # Watch files and take action when they change
brew 'wcurl'
brew 'webkit2png'                   # Create screenshots of webpages from the terminal
brew 'wget'                         # Internet file retriever
brew 'wget2'                        # Successor of GNU Wget, a file and recursive website downloader
brew 'whatmask'                     # Network settings helper
brew 'wrk'
brew 'xh'
brew 'xidel'
brew 'xq'
brew 'yank'                         #
brew 'yj'                           #
brew 'yq'                           #
# brew 'yt-dlp'
brew 'zopfli'                       # New zlib (gzip, deflate) compatible compressor
brew 'zoxide'                       # Shell extension to navigate your filesystem faster
brew 'zq'                           #
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'zsh'


brew 'liujianping/tap/job'

# ================================
# AWS
# ================================
tap 'aws/tap'
brew 'awscli'
brew 'aws-sam-cli'
brew 'aws-keychain'

# ================================
# Custom taps
# ================================
# tap 'teamookla/speedtest'
brew 'teamookla/speedtest/speedtest' # Ookla Speedtest
tap 'cantino/mcfly'
brew 'mcfly'

# ================================
# Databases & tools
# ================================
brew 'redis'

# ================================
# Git utils
# ================================
tap 'isacikgoz/taps'
brew 'bfg'                          # Remove large files or passwords from Git history like git-filter-branch
brew 'gh'                           # GitHub command-line tool
brew 'ghq'                          # Remote repository management made easy
brew 'git-extras'                   # Small git utilities
brew 'git-filter-repo'              # Quickly rewrite git repository history
brew 'git-lfs'                      # Git extension for versioning large files
brew 'git-plus'                     # Git utilities: git multi, git relation, git old-branches, git recent
brew 'git-quick-stats'              # Simple and efficient way to access statistics in gitp
brew 'gitbatch'                     # Manage your git repositories in one place
brew 'hub'                          # Add GitHub support to git on the command-line
brew 'mr'                           # Multiple Repository management tool
brew 'pygitup'                      # Nicer 'git pull'


#tap 'gitea/tap', 'https://gitea.com/gitea/homebrew-gitea'
#brew 'gitea'

# ================================
# GNU TOOLS
# ================================
brew 'moreutils', link: false
brew 'binutils'
brew 'binwalk'
brew 'cmake'
brew 'coreutils'
brew 'findutils'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnu-which'
brew 'gnutls'
brew 'grep'
brew 'less'
brew 'parallel'
brew 'util-linux'
brew 'wdiff'


# ================================
# DUPES
# ================================
brew 'diffutils'
brew 'gpatch'
brew 'make'
brew 'nano'

# ================================
# EXTRAS
# ================================


# ================================
# SCIENCE
# ================================


# ================================
# FONTS
# ================================
cask 'font-fira-code-nerd-font'
cask 'font-fira-code'
cask 'font-fira-mono-nerd-font'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-firago'
cask 'font-hack-nerd-font'
cask 'font-inconsolata'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-lato'
cask 'font-meslo-lg-nerd-font'
cask 'font-ubuntu-mono-nerd-font'
cask 'font-victor-mono-nerd-font'


# NERD FONTS
# ~/Library/Fonts

# cask 'font-3270-nerd-font'
# cask 'font-agave-nerd-font'
# cask 'font-anonymice-nerd-font'
# cask 'font-arimo-nerd-font'
# cask 'font-aurulent-sans-mono-nerd-font'
# cask 'font-bigblue-terminal-nerd-font'
# cask 'font-bitstream-vera-sans-mono-nerd-font'
# cask 'font-blex-mono-nerd-font'
# cask 'font-caskaydia-cove-nerd-font'
# cask 'font-code-new-roman-nerd-font'
# cask 'font-cousine-nerd-font'
# cask 'font-daddy-time-mono-nerd-font'
# cask 'font-dejavu-sans-mono-nerd-font'
# cask 'font-droid-sans-mono-nerd-font'
# cask 'font-fantasque-sans-mono-nerd-font'
# cask 'font-fira-code-nerd-font'
# cask 'font-fira-mono-nerd-font'
# cask 'font-go-mono-nerd-font'
# cask 'font-gohufont-nerd-font'
# cask 'font-hackgen-nerd'
# cask 'font-hasklug-nerd-font'
# cask 'font-heavy-data-nerd-font'
# cask 'font-hurmit-nerd-font'
# cask 'font-im-writing-nerd-font'
# cask 'font-inconsolata-go-nerd-font'
# cask 'font-inconsolata-lgc-nerd-font'
# cask 'font-inconsolata-nerd-font'
# cask 'font-iosevka-nerd-font'
# cask 'font-jetbrains-mono-nerd-font'
# cask 'font-lekton-nerd-font'
# cask 'font-liberation-nerd-font'
# cask 'font-meslo-lg-nerd-font'
# cask 'font-monofur-nerd-font'
# cask 'font-monoid-nerd-font'
# cask 'font-mononoki-nerd-font'
# cask 'font-mplus-nerd-font'
# cask 'font-noto-nerd-font'
# cask 'font-open-dyslexic-nerd-font'
# cask 'font-overpass-nerd-font'
# cask 'font-profont-nerd-font'
# cask 'font-proggy-clean-tt-nerd-font'
# cask 'font-roboto-mono-nerd-font'
# cask 'font-sauce-code-pro-nerd-font'
# cask 'font-shure-tech-mono-nerd-font'
# cask 'font-space-mono-nerd-font'
# cask 'font-terminess-ttf-nerd-font'
# cask 'font-tinos-nerd-font'
# cask 'font-ubuntu-mono-nerd-font'
# cask 'font-ubuntu-nerd-font'
# cask 'font-victor-mono-nerd-font'
