cask_args appdir: '/Applications'

tap 'homebrew/bundle'
#tap 'homebrew/dupes'
#tap 'homebrew/games'
#tap 'homebrew/versions'
#tap 'homebrew/science'
#tap 'homebrew/completions'
tap 'homebrew/services'

# ================================
# DEPS / PROGRAMMING LANGUAGES
# ================================
# brew 'git-annex'
brew 'go'
# brew 'haskell-stack'
# brew 'haskell-stack ghc cabal-install'
# brew 'n'
brew 'python'                       # Interpreted, interactive, object-oriented programming language
brew 'python3'                      # Interpreted, interactive, object-oriented programming language
brew 'chruby'                       # Ruby environment tool
brew 'ruby-build'                   # Install various Ruby versions and implementations
brew 'ruby-install'                 # Install Ruby, JRuby, Rubinius, MagLev, or mruby
brew 'xhyve', args: ['--HEAD']      # xhyve, lightweight macOS virtualization solution based on FreeBSD's bhyve

# ================================
# CLI stuff
# ================================
#brew 'ansible'                    # Automate deployment, configuration, and upgrading
#brew 'ctop'
#brew 'nvm'                        	# Manage multiple Node.js versions
#brew 'sen'
brew 'ack'                          # Search tool like grep, but optimized for programmers
brew 'aircrack-ng'                  # Next-generation aircrack with lots of new features
brew 'awscli'                       # Official Amazon AWS command-line interface
brew 'cmatrix'                      # Console Matrix
brew 'consul', args: ['--with-web-ui']  # Tool for service discovery, monitoring and configuration
brew 'dark-mode'                    # Control the macOS dark mode from the command-line
brew 'dash'                         # POSIX-compliant descendant of NetBSD's ash (the Almquist SHell)
brew 'dlite'                        # Provides a way to use docker on macOS without docker-machine
brew 'fakeroot'                     # Provide a fake root environment
brew 'figlet'                       # Banner-like program prints strings as ASCII art
brew 'git-crypt'                    # Enable transparent encryption/decryption of files in a git repo
brew 'graphicsmagick'               # Image processing tools collection
brew 'graphviz'                     # Graph visualization software from AT&T and Bell Labs
brew 'hugo'                         # Configurable static site generator
brew 'hydra'                        # Network logon cracker which supports many services
brew 'knock'                        # Port-knock server
brew 'libav'                        # Audio and video processing tools
brew 'mc'                           # Terminal-based visual file manager
brew 'neofetch'                     # Fast, highly customisable system info script
brew 'netpbm'                       # Image manipulation
brew 'peco'                         # Simplistic interactive filtering tool
brew 'readline'                     # Library for command-line editing
brew 'rgxg'                         # C library and command-line tool to generate (extended) regular expressions
brew 'rlwrap'                       # Readline wrapper: adds readline support to tools that lack it
brew 'serf'                         # Service orchestration and management tool
brew 'shfmt'                        # Autoformat shell script source code
brew 'socat'                        # netcat on steroids
brew 'speedtest_cli'                # Command-line interface for https://speedtest.net bandwidth tests
brew 'sqlmap'                       # Penetration testing for SQL injection and database servers
brew 'ssh-copy-id'                  # Add a public key to a remote machine's authorized_keys file
brew 'sshrc'                        # Bring your .bashrc, .vimrc, etc. with you when you SSH
brew 'syncthing'
brew 'tcpflow'
brew 'vcsh'                         # Config manager based on git
brew 'zsh'

# ================================
# Browsers
# ================================
brew 'w3m'
brew 'elinks'
brew 'lynx'

# ================================
# Databases & tools
# ================================
#brew 'couchdb'
#brew 'mariadb'
#brew 'mongodb'
#brew 'mysql'
#brew 'neo4j'
#brew 'postgresql'
#brew 'rethinkdb'
#brew 'riak'
#brew 'sqlite'

#tap 'theory/sqitch'
#brew 'sqitch'
#brew 'sqitch_pg'


# ================================
# EXTRAS
# ================================
tap 'thoughtbot/formulae'
brew 'gitsh'

tap 'yudai/gotty'
brew 'gotty'

tap 'joshuaclayton/formulae'
brew 'unused'

# ================================
# SCIENCE
# ================================
#brew 'opencv'
