cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/homebrew-core'
#tap 'homebrew/dupes'
#tap 'homebrew/games'
#tap 'homebrew/versions'
#tap 'homebrew/science'
#tap 'homebrew/completions'
tap 'homebrew/services'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'


# ================================
# DEPS / PROGRAMMING LANGUAGES
# ================================
#brew 'node@12'
brew 'git'
brew 'golang'
brew 'python'                       # Interpreted, interactive, object-oriented programming language
brew 'python3'                      # Interpreted, interactive, object-oriented programming language
brew 'rust'                         # Safe, concurrent, practical language

# ================================
# Virtual Machine stuff
# ================================
brew 'packer'
brew 'packer-completion'

# ================================
# CLI stuff
# ================================
#brew 'git-crypt'                    # Enable transparent encryption/decryption of files in a git repo
#brew 'sshfs'                       # File system client based on SSH File Transfer Protocol
#brew 'stow'                        # Organize software neatly under a single directory tree (e.g. /usr/local)
#brew 'goaccess'                     # Log analyzer and interactive viewer for the Apache Webserver
brew 'ack'                          # Search tool like grep, but optimized for programmer
brew 'ag'                           # A code-searching tool similar to ack, but faster
brew 'archey'                       # Graphical system information display for macOS
brew 'aria2'                        # Download with resuming and segmented downloading
brew 'axel'                         # Light UNIX download accelerator
brew 'bandwhich'                    # Bourne-Again SHell, a UNIX command interpreter
brew 'bash-completion2'             # Programmable completion for Bash 4.1+
brew 'bash'                         # Bourne-Again SHell, a UNIX command interpreter
brew 'bat'                          # Clone of cat(1) with syntax highlighting and Git integration
brew 'bento4'
brew 'bmon'                         # Interface bandwidth monitor
brew 'borgbackup'                   # Deduplicating archiver with compression and authenticated encryption
brew 'broot'                        # New way to see and navigate directory trees
brew 'cliclick'                     # Tool for emulating mouse and keyboard events
brew 'cloc'                         # Statistics utility to count lines of code
brew 'colordiff'                    # Color-highlighted diff(1) output
brew 'cv'                           # Progress: Coreutils Progress Viewer
brew 'dfc'                          # Display graphs and colors of file system space/usage
brew 'dialog'                       # Display user-friendly message boxes from shell scripts
brew 'direnv'                       # Load/unload environment variables based on $PWD
brew 'dust'                         # More intuitive version of du in rust
brew 'entr'                         # Run arbitrary commands when files change
brew 'eth-p/software/bat-extras'    # Bash scripts that integrate bat with various command-line tools
brew 'exa'                          # Modern replacement for 'ls
brew 'exiftool'                     # Perl lib for reading and writing EXIF metadata
brew 'faas-cli'                     # CLI for templating and/or deploying FaaS functions
brew 'fasd'                         # CLI tool for quick access to files and directories
brew 'fd'                           # Simple, fast and user-friendly alternative to find
brew 'ffind'                        # Friendlier find
brew 'ffmpeg'                       # Play, record, convert, and stream audio and video
brew 'fish'                         # User-friendly command-line shell for UNIX-like operating systems
brew 'fnm'                          # Fast and simple Node.js version manager
brew 'fswatch'                      # Monitor a directory for changes and run a shell command
brew 'fzf'                          # Command-line fuzzy finder written in Go
brew 'fzy'                          # Fast, simple fuzzy text selector with an advanced scoring algorithm.
brew 'gpg'                          # GNU Pretty Good Privacy (PGP) package
brew 'graphviz'                     # Graph visualization software from AT&T and Bell Labs
brew 'grc'                          # Colorize logfiles and command output
brew 'grex'                         # Command-line tool for generating regular expressions
brew 'hashdeep'                     # Recursively compute digests on files/directories
brew 'hh'                           # Bash and zsh history suggest box
brew 'htop'                         # Improved top (interactive process viewer)
brew 'httpie'                       # User-friendly cURL replacement (command-line HTTP client)
brew 'httpry'                       # Packet sniffer for displaying and logging HTTP traffic
brew 'hugo'                         # Configurable static site generator
brew 'ifstat'                       # Tool to report network interface bandwidth
brew 'iftop'                        # Display an interface's bandwidth usage
brew 'imagemagick'                  # Tools and libraries to manipulate images in many formats
brew 'imageoptim-cli'               # CLI for ImageOptim, ImageAlpha and JPEGmini
brew 'jid'                          # Json incremental digger
brew 'jpeg'                         # Image manipulation library
brew 'jpegoptim'                    # Utility to optimize JPEG files
brew 'jq'                           # Lightweight and flexible command-line JSON processor
brew 'kubernetes-cli'               # Tool to report network interface bandwidth
brew 'lazydocker'                   # The lazier way to manage everything docker
brew 'lnav'                         # Curses-based tool for viewing and analyzing log files
brew 'm-cli'                        # Swiss Army Knife for macOS
brew 'mackup'                       # Keep your Mac's application settings in sync
brew 'mas'                          # Mac App Store command-line interface
brew 'micro'                        # Modern and intuitive terminal-based text editor
brew 'mmv'                          # Move, copy, append, and link multiple files
brew 'most'                         # Powerful paging program
brew 'mozjpeg'                      # Improved JPEG encoder
brew 'mtr'                          # 'traceroute' and 'ping' in a single tool
brew 'multitail'                    # Tail multiple files in one terminal simultaneously
brew 'ncdu'                         # NCurses Disk Usage
brew 'neofetch'                     # Fast, highly customisable system info script
brew 'nethogs'                      # Net top tool grouping bandwidth per process
brew 'nginx'                        # HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew 'ngrep'                        # Network grep
brew 'nload'                        # Realtime console network usage monitor
brew 'nmap'                         # Port scanning utility for large networks
brew 'noti'                         # Trigger notifications when a process completes
brew 'nushell'                      # Modern shell for the GitHub era
brew 'optipng'                      # PNG file optimizer
brew 'pbzip2'                       # Parallel bzip2
brew 'pgrep'                        # OpenBSD and Darwin versions of pgrep, pkill, and pfind
brew 'pidof'                        # Display the PID number for a given process name
brew 'pigz'                         # Parallel gzip
brew 'plzip'                        # Data compressor
brew 'pngcheck'                     # Print info and check PNG, JNG, and MNG files
brew 'pngquant'                     # PNG image optimizing utility
brew 'ppsspp'                       # PlayStation Portable emulator
brew 'procs'                        # Modern replacement for ps written by Rust
brew 'psgrep'                       # Shortcut for the 'ps aux | grep' idiom
brew 'pv'                           # Monitor data's progress through a pipe
brew 'pygments'                     # Generic syntax highlighter
brew 'rdiff-backup'                 # Reverse differential backup tool, over a network or locally
brew 'rename'                       # Perl-powered file rename script with many helpful built-ins
brew 'renameutils'                  # Tools for file renaming
brew 'ripgrep-all'                  # Wrapper around ripgrep that adds multiple rich file types
brew 'ripgrep'                      # Search tool like grep and The Silver Searcher
brew 'rsnapshot'                    # File system snapshot utility (based on rsync)
brew 'rsync'                        # Utility that provides fast incremental file transfer
brew 'sd'                           # Intuitive find & replace CLI
brew 'sk'                           # Fuzzy Finder in rust!
brew 'speedtest-cli'                # Command-line interface for https://speedtest.net bandwidth tests
brew 'sqlite'                       # Command-line interface for SQLite
brew 'sshuttle'                     # Proxy server that works as a poor man's VPN
brew 'starship'                     # Cross-shell prompt for astronauts
brew 'stress'                       # Tool to impose load on and stress test a computer system
brew 'svgo'                         # Nodejs-based tool for optimizing SVG vector graphics files
brew 'svn'                          # Nodejs-based tool for optimizing SVG vector graphics files
brew 'svtplay-dl'                   # Download videos from https://www.svtplay.se/
brew 'sysbench'                     # System performance benchmark tool
brew 'tig'                          # Text interface for Git repositories
brew 'tmux'                         # Terminal multiplexer
brew 'tokei'                        # Program that allows you to count code, quickly
brew 'trash'                        # CLI tool that moves files or folder to the trash
brew 'tealdeer'                     # Very fast implementation of tldr in Rust
brew 'tree'                         # Display directories as trees (with optional color/HTML output)
brew 'unar'                         # Command-line unarchiving tools supporting multiple formats
brew 'unison'                       # File synchronization tool for OSX
brew 'vbindiff'                     # Visual Binary Diff
brew 'vcsh'                         # Config manager based on git
brew 'vips'                         # Image processing library
brew 'vnstat'                       # Console-based network traffic monitor
brew 'watch'                        # Executes a program periodically, showing output fullscreen
brew 'watchman'                     # Watch files and take action when they change
brew 'webkit2png'                   # Create screenshots of webpages from the terminal
brew 'wget'                         # Internet file retriever
brew 'whatmask'                     # Network settings helper
brew 'youtube-dl'                   # Download YouTube videos from the command-line
brew 'zopfli'                       # New zlib (gzip, deflate) compatible compressor
brew 'zoxide'                       # Shell extension to navigate your filesystem faster
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'zsh'



# ================================
# Custom taps
# ================================
tap 'teamookla/speedtest'
brew 'teamookla/speedtest/speedtest' # Ookla Speedtest

# ================================
# Databases & tools
# ================================
brew 'redis'

# ================================
# Git utils
# ================================
tap 'isacikgoz/taps'
brew 'bfg'                          # Remove large files or passwords from Git history like git-filter-branch
brew 'gh'                           # GitHub command-line tool
brew 'ghq'                          # Remote repository management made easy
brew 'git-delta'                    # Syntax-highlighting pager for git and diff output
brew 'git-extras'                   # Small git utilities
brew 'git-filter-repo'              # Quickly rewrite git repository history
brew 'git-lfs'                      # Git extension for versioning large files
brew 'git-plus'                     # Git utilities: git multi, git relation, git old-branches, git recent
brew 'gitbatch'                     # Manage your git repositories in one place
brew 'hub'                          # Add GitHub support to git on the command-line
brew 'mr'                           # Multiple Repository management tool
brew 'pygitup'                      # Nicer 'git pull'
brew 'git-quick-stats'              # Simple and efficient way to access statistics in gitp


#tap 'gitea/tap', 'https://gitea.com/gitea/homebrew-gitea'
#brew 'gitea'

# ================================
# GNU TOOLS
# ================================
brew 'binutils'
brew 'binwalk'
brew 'cmake'
brew 'coreutils'
brew 'findutils'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnu-which'
brew 'gnutls'
brew 'grep'
brew 'moreutils'
brew 'wdiff'

# ================================
# DUPES
# ================================
brew 'diffutils'
brew 'gpatch'
brew 'make'
brew 'nano'

# ================================
# EXTRAS
# ================================


# ================================
# SCIENCE
# ================================


# ================================
# FONTS
# ================================
cask 'font-fira-code-nerd-font'
cask 'font-fira-code'
cask 'font-fira-mono-nerd-font'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-firago'
cask 'font-hack-nerd-font'
cask 'font-inconsolata'
cask 'font-inconsolata-g'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-victor-mono-nerd-font'
cask 'font-victor-mono'
cask 'font-meslo-lg-nerd-font'

# NERD FONTS
# ~/Library/Fonts

# cask 'font-3270-nerd-font'
# cask 'font-agave-nerd-font'
# cask 'font-anonymice-nerd-font'
# cask 'font-arimo-nerd-font'
# cask 'font-aurulent-sans-mono-nerd-font'
# cask 'font-bigblue-terminal-nerd-font'
# cask 'font-bitstream-vera-sans-mono-nerd-font'
# cask 'font-blex-mono-nerd-font'
# cask 'font-caskaydia-cove-nerd-font'
# cask 'font-code-new-roman-nerd-font'
# cask 'font-cousine-nerd-font'
# cask 'font-daddy-time-mono-nerd-font'
# cask 'font-dejavu-sans-mono-nerd-font'
# cask 'font-droid-sans-mono-nerd-font'
# cask 'font-fantasque-sans-mono-nerd-font'
# cask 'font-fira-code-nerd-font'
# cask 'font-fira-mono-nerd-font'
# cask 'font-go-mono-nerd-font'
# cask 'font-gohufont-nerd-font'
# cask 'font-hackgen-nerd'
# cask 'font-hasklug-nerd-font'
# cask 'font-heavy-data-nerd-font'
# cask 'font-hurmit-nerd-font'
# cask 'font-im-writing-nerd-font'
# cask 'font-inconsolata-go-nerd-font'
# cask 'font-inconsolata-lgc-nerd-font'
# cask 'font-inconsolata-nerd-font'
# cask 'font-iosevka-nerd-font'
# cask 'font-jetbrains-mono-nerd-font'
# cask 'font-lekton-nerd-font'
# cask 'font-liberation-nerd-font'
# cask 'font-meslo-lg-nerd-font'
# cask 'font-monofur-nerd-font'
# cask 'font-monoid-nerd-font'
# cask 'font-mononoki-nerd-font'
# cask 'font-mplus-nerd-font'
# cask 'font-noto-nerd-font'
# cask 'font-open-dyslexic-nerd-font'
# cask 'font-overpass-nerd-font'
# cask 'font-profont-nerd-font'
# cask 'font-proggy-clean-tt-nerd-font'
# cask 'font-roboto-mono-nerd-font'
# cask 'font-sauce-code-pro-nerd-font'
# cask 'font-shure-tech-mono-nerd-font'
# cask 'font-space-mono-nerd-font'
# cask 'font-terminess-ttf-nerd-font'
# cask 'font-tinos-nerd-font'
# cask 'font-ubuntu-mono-nerd-font'
# cask 'font-ubuntu-nerd-font'
# cask 'font-victor-mono-nerd-font'
