cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/games'
tap 'homebrew/versions'
tap 'homebrew/science'

# ================================
# DEPS / PROGRAMMING LANGUAGES
# ================================
brew 'git'
brew 'git-annex'
brew 'git-lfs'
brew 'go'
# brew 'haskell-stack'
# brew 'haskell-stack ghc cabal-install'
brew 'n'
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'ruby-build'
brew 'xhyve', args: ['--HEAD']

# ================================
# CLI stuff
# ================================
brew 'ack'
brew 'aircrack-ng'
brew 'ag'
brew 'ansible'
brew 'aria2'
brew 'axel'
brew 'azukiapp/azk/azk'
brew 'bash'
brew 'bmon'
brew 'bash-completion2'
brew 'cloc'
brew 'colordiff'
brew 'cv'
brew 'cmatrix'
brew 'dark-mode'
brew 'dash'
brew 'dfc'
brew 'dialog'
brew 'dlite'
brew 'fasd'
brew 'ffmpeg'
brew 'figlet'
brew 'fzf'
brew 'gawk'
brew 'goaccess'
brew 'graphicsmagick'
brew 'grc'
brew 'hh'
brew 'htop'
brew 'httpie'
brew 'httpry'
brew 'hub'
brew 'hydra'
brew 'hugo'
brew 'ifstat'
brew 'iftop'
brew 'iptraf-ng'
brew 'imagemagick'
brew 'jpegoptim'
brew 'jq'
brew 'lnav'
brew 'mc'
brew 'netpbm'
brew 'nload'
brew 'nethogs'
brew 'mtr'
brew 'ncdu'
brew 'ngrep'
brew 'multitail'
brew 'knock'
brew 'nmap'
brew 'pigz'
brew 'pv'
brew 'readline'
brew 'rename'
brew 'rgxg'
brew 'rlwrap'
brew 'speedtest_cli'
brew 'ssh-copy-id'
brew 'sshrc'
brew 'stow'
brew 'socat'
brew 'syncthing'
brew 'sysbench'
brew 'tcpflow'
brew 'thefuck'
brew 'tig'
brew 'trash'
brew 'tree'
brew 'unrar'
brew 'vbindiff'
brew 'vcsh'
brew 'vnstat'
brew 'watch'
brew 'watchman'
brew 'webkit2png'
brew 'pngcheck'
brew 'sqlmap'
brew 'wget'
brew 'whatmask'
brew 'youtube-dl'
brew 'zopfli'
brew 'zsh'
brew 'zsh-syntax-highlighting'

# ================================
# Databases
# ================================
brew 'couchdb'
brew 'mongodb'
brew 'mysql'
brew 'postgresql'
brew 'redis'
brew 'riak'
brew 'sqlite'


# ================================
# GNU TOOLS
# ================================
brew 'binutils'
brew 'binwalk'
brew 'coreutils'
brew 'findutils', args: ['with-default-names']
brew 'gnu-indent', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'gnutls'
brew 'grep', args: ['with-default-names']
brew 'moreutils'
brew 'wdiff', args: ['with-gettext']


# ================================
# DUPES
# ================================
brew 'diffutils'
brew 'gpatch'
brew 'make'
brew 'nano'


# ================================
# FORMULAS FOR DEVS
# ================================
cask 'alfred'
cask 'appcleaner'
cask 'applepi-baker'
cask 'atom'
cask 'bitbar'
cask 'caffeine'
cask 'cakebrew'
cask 'ccleaner'
cask 'cdock'
cask 'charles'
cask 'cheatsheet'
cask 'controlplane'
cask 'cronnix'
cask 'cyberduck'
cask 'disk-inventory-x'
cask 'diskwave'
cask 'dockertoolbox'
cask 'dropbox'
cask 'firefox'
cask 'fluid'
cask 'forklift'
cask 'fwbuilder'
cask 'git-annex'
cask 'github-desktop'
cask 'google-chrome'
cask 'google-earth'
cask 'hammerspoon'
cask 'hipchat'
cask 'imageoptim'
cask 'jadengeller-helium'
cask 'iterm2'
cask 'keycastr'
cask 'launchcontrol'
cask 'licecap'
cask 'loading'
cask 'macdown'
cask 'madruby'
cask 'monolingual'
cask 'ngrok'
cask 'onyx'
cask 'paw'
cask 'pixlr'
cask 'sdformatter'
cask 'sequel-pro'
cask 'silverlight'
cask 'sizeup'
cask 'sketch'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'smartgit'
cask 'sourcetree'
cask 'spectacle'
cask 'sublime-text'
cask 'teamviewer'
cask 'the-unarchiver'
cask 'transmission'
cask 'ubersicht'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'vmware-fusion'
cask 'vox'
cask 'vox-preferences-pane'
cask 'wireshark'
cask 'xquartz'
cask 'xtrafinder'
cask 'yujitach-menumeters'
cask 'webhook'


# ================================
# FONTS
# ================================
cask 'font-inconsolata'
cask 'font-source-code-pro'


# ================================
# ENTERTAINMENT & AFTERWORK :-)
# ================================
cask 'dolphin'
cask 'openemu'
cask 'plex-media-player'
cask 'retroarch'
cask 'sonos'
cask 'spotify'
cask 'steam'
cask 'teeworlds'
cask 'wineskin-winery'

# ================================
# EXTRAS
# ================================
tap 'thoughtbot/formulae'
brew 'gitsh'

tap 'yudai/gotty'
brew 'gotty'

# ================================
# SCIENCE
# ================================
#brew 'opencv'
